yorickdewid/RODOS/rodos-core/src/bare-metal/arm_v4/lpc24xx_registers.h
//Added by DLR RY-AS
//author: David Waleczek

// ----------------------------------------------------------------------------
//Interrupt Bit Allocation Table

union _INTAT
{
	unsigned volatile long wordreg;
	struct
	{	volatile unsigned	WDT	  	: 1;
		volatile unsigned		  	: 1;
		volatile unsigned	ARMCore0: 1;
		volatile unsigned	ARMCore1: 1;
		volatile unsigned	TIMER0  : 1;
		volatile unsigned	TIMER1  : 1;
		volatile unsigned	UART0  	: 1;
		volatile unsigned	UART1  	: 1;
		volatile unsigned	PWM  	: 1;
		volatile unsigned	I2C0  	: 1;
		volatile unsigned	SPISPP0	: 1;
		volatile unsigned	SSP1  	: 1;
		volatile unsigned	PLL  	: 1;
		volatile unsigned	RTC  	: 1;
		volatile unsigned	EINT0  	: 1;
		volatile unsigned	EINT1  	: 1;
		volatile unsigned	EINT2  	: 1;
		volatile unsigned	EINT3  	: 1;
		volatile unsigned	ADC  	: 1;
		volatile unsigned	I2C1  	: 1;
		volatile unsigned	BOD  	: 1;
		volatile unsigned	ETHNET	: 1;
		volatile unsigned	USB		: 1;
		volatile unsigned	CAN  	: 1;
		volatile unsigned	SDC  	: 1;
		volatile unsigned	GPDMA  	: 1;
		volatile unsigned	TIMER2  : 1;
		volatile unsigned	TIMER3  : 1;
		volatile unsigned	UART2  	: 1;
		volatile unsigned	UART3  	: 1;
		volatile unsigned	I2C2  	: 1;
		volatile unsigned	I2S  	: 1;		
	} peripheral;
};

// ----------------------------------------------------------------------------
//Interrupt Bit Allocation Table as constants for pointer
#define iWDT	  	0
#define iARMCore0	2
#define iARMCore1	3
#define iTIMER0  	4
#define iTIMER1  	5
#define iUART0  	6
#define iUART1  	7
#define iPWM  		8
#define iI2C0  		9
#define iSPISPP0	10
#define iSSP1  		11
#define iPLL  		12
#define iRTC  		13
#define iEINT0  	14
#define iEINT1  	15
#define iEINT2  	16
#define iEINT3  	17
#define iADC  		18
#define iI2C1  		19
#define iBOD  		20
#define iETHNET		21
#define iUSB		22
#define iCAN  		23
#define iSDC  		24
#define iGPDMA  	25
#define iTIMER2  	26
#define iTIMER3  	27
#define iUART2  	28
#define iUART3  	29
#define iI2C2  		30
#define iI2S  		31

// ----------------------------------------------------------------------------
 //Timer Match Control Register
union _TxMCR
{
	unsigned volatile short wordreg;
	struct
	{	volatile unsigned	MR0I  	: 1;
		volatile unsigned	MR0R  	: 1;
		volatile unsigned	MR0S  	: 1;
		volatile unsigned	MR1I  	: 1;
		volatile unsigned	MR1R  	: 1;
		volatile unsigned	MR1S  	: 1;
		volatile unsigned	MR2I  	: 1;
		volatile unsigned	MR2R  	: 1;
		volatile unsigned	MR2S  	: 1;
		volatile unsigned	MR3I  	: 1;
		volatile unsigned	MR3R  	: 1;
		volatile unsigned	MR3S  	: 1;
		volatile unsigned			: 4;
	} function;
};


struct _TxTCR
{
		volatile unsigned	enable  : 1;
		volatile unsigned	reset  	: 1;	
};

//CountTimMode Values:
#define TimMod	0			//Timer Mode: every rising PCLK edge
//Counter Mode: the CAP input selected by CountInSel
#define risCount	1		//Counter Mode: TC is incremented on rising edges
#define fallCount	2		//Counter Mode: TC is incremented on falling edges
#define bothCount	3		//Counter Mode: TC is incremented on both edges

#define CAP0		0		//CAPn.0 for TIMERn
#define CAP1		1		//CAPn.1 for TIMERn


struct _TxCTCR
{
		volatile unsigned	CountTimMode 	: 2;
		volatile unsigned	CountInSel		: 2;
};

struct _TxCCR
{
		volatile unsigned	CAP0RE 	: 1; 	//Capture on CAPn.0 rising edge: a sequence of 0 then 1 on
									//CAPn.0 will cause CR0 to be loaded with the contents of TC.

		volatile unsigned	CAP0FE	: 1;	//Capture on CAPn.0 falling edge: a sequence of 1 then 0 on
									//CAPn.0 will cause CR0 to be loaded with the contents of TC.

		volatile unsigned	CAP0I 	: 1;	//Interrupt on CAPn.0 event: a CR0 load due to a CAPn.0 event
									//will generate an interrupt.

		volatile unsigned	CAP1RE	: 1;	//Capture on CAPn.1 rising edge: a sequence of 0 then 1 on
									//CAPn.1 will cause CR1 to be loaded with the contents of TC.

		volatile unsigned	CAP1FE 	: 1;	//Capture on CAPn.1 falling edge: a sequence of 1 then 0 on
									//CAPn.1 will cause CR1 to be loaded with the contents of TC.

		volatile unsigned	CAP1I	: 1;	//Interrupt on CAPn.1 event: a CR1 load due to a CAPn.1 event
									//will generate an interrupt.

		volatile unsigned		 	: 10;

};


struct _TxEMR
{
		volatile unsigned	EM0 	: 1;  	//External Match 0. 
									//When a match occurs between the TC and MR0, this 
									//bit can either toggle, go low, go high, or do nothing, depending on bits 5:4
									//of this register. This bit can be driven onto a MATn.0 pin, in a
									//positive-logic manner (0 = low, 1 = high).
		volatile unsigned	EM1		: 1;	//External Match 1
		volatile unsigned	EM2 	: 1;	//External Match 2
		volatile unsigned	EM3		: 1;	//External Match 3
		volatile unsigned	EMC0 	: 2;	//External Match Control 0. Determines the functionality of External Match 0.
		volatile unsigned	EMC1 	: 2;	//External Match Control 1. Determines the functionality of External Match 1.
		volatile unsigned	EMC2 	: 2;	//External Match Control 2. Determines the functionality of External Match 2.
		volatile unsigned	EMC3	: 2;	//External Match Control 3. Determines the functionality of External Match 3.
		volatile unsigned		 	: 4;

};

struct _TxIR
{
		volatile unsigned	MR0I  : 1;
		volatile unsigned	MR1I  : 1;
		volatile unsigned	MR2I  : 1;
		volatile unsigned	MR3I  : 1;
		volatile unsigned	CR0I  : 1;
		volatile unsigned	CR1I  : 1;
		volatile unsigned	CR2I  : 1;
		volatile unsigned	CR3I  : 1;	
};

// ----------------------------------------------------------------------------
//power config register
union _PCONP
{
	unsigned volatile long wordreg;
	struct
	{	volatile unsigned		  	: 1;
		volatile unsigned	TIMER0  : 1;
		volatile unsigned	TIMER1  : 1;
		volatile unsigned	UART0  	: 1;
		volatile unsigned	UART1  	: 1;
		volatile unsigned	PWM0  	: 1;
		volatile unsigned	PWM1  	: 1;
		volatile unsigned	I2C0  	: 1;
		volatile unsigned	SPI  	: 1;
		volatile unsigned	RTC  	: 1;
		volatile unsigned	SSP1  	: 1;
		volatile unsigned	EMC  	: 1;
		volatile unsigned	ADC  	: 1;
		volatile unsigned	CAN1  	: 1;
		volatile unsigned	CAN2  	: 1;
		volatile unsigned		  	: 4;
		volatile unsigned	I2C1  	: 1;
		volatile unsigned  	LCD		: 1;
		volatile unsigned	SSP0  	: 1;
		volatile unsigned	TIMER2  : 1;
		volatile unsigned	TIMER3  : 1;
		volatile unsigned	UART2  	: 1;
		volatile unsigned	UART3  	: 1;
		volatile unsigned	I2C2  	: 1;
		volatile unsigned	I2S  	: 1;
		volatile unsigned	SDC  	: 1;
		volatile unsigned	GPDMA  	: 1;
		volatile unsigned	ETHNET	: 1;
		volatile unsigned	USB		: 1;
	} peripheral;
};

// ----------------------------------------------------------------------------
//pclk selection registers
union _PCLKSEL0
{
	unsigned volatile long wordreg;
	struct
	{	volatile unsigned	WDT  	: 2;
		volatile unsigned	TIMER0  : 2;
		volatile unsigned	TIMER1  : 2;
		volatile unsigned	UART0  	: 2;
		volatile unsigned	UART1  	: 2;
		volatile unsigned	PWM0  	: 2;
		volatile unsigned	PWM1  	: 2;
		volatile unsigned	I2C0  	: 2;
		volatile unsigned	SPI  	: 2;
		volatile unsigned	RTC  	: 2;
		volatile unsigned	SSP1  	: 2;
		volatile unsigned	DAC  	: 2;
		volatile unsigned	ADC  	: 2;
		volatile unsigned	CAN1  	: 2;
		volatile unsigned	CAN2  	: 2;
		volatile unsigned	ACF  	: 2;
	} peripheral;
};

union _PCLKSEL1
{
	unsigned volatile long wordreg;
	struct
	{	volatile unsigned	BAT_RAM : 2;
		volatile unsigned	GPIO  	: 2;
		volatile unsigned	PCB  	: 2;
		volatile unsigned	I2C1  	: 2;
		volatile unsigned  			: 2;
		volatile unsigned	SSP0  	: 2;
		volatile unsigned	TIMER2  : 2;
		volatile unsigned	TIMER3  : 2;
		volatile unsigned	UART2  	: 2;
		volatile unsigned	UART3  	: 2;
		volatile unsigned	I2C2  	: 2;
		volatile unsigned	I2S  	: 2;
		volatile unsigned	MCI  	: 2;
		volatile unsigned		  	: 2;
		volatile unsigned	SYSCON  : 2;
		volatile unsigned			: 2;
	} peripheral;
};

// ----------------------------------------------------------------------------
#define T0MCR_p		((union _TxMCR *) &T0MCR)
#define T1MCR_p		((union _TxMCR *) &T1MCR)
#define T2MCR_p		((union _TxMCR *) &T2MCR)
#define T3MCR_p		((union _TxMCR *) &T3MCR)

#define T0TCR_p		((struct _TxTCR *) &T0TCR)
#define T1TCR_p		((struct _TxTCR *) &T1TCR)
#define T2TCR_p		((struct _TxTCR *) &T2TCR)
#define T3TCR_p		((struct _TxTCR *) &T3TCR)

#define T0CTCR_p	((struct _TxCTCR *) &T0CTCR)
#define T1CTCR_p	((struct _TxCTCR *) &T1CTCR)
#define T2CTCR_p	((struct _TxCTCR *) &T2CTCR)
#define T3CTCR_p	((struct _TxCTCR *) &T3CTCR)

#define T0CCR_p		((struct _TxCCR *) &T0CCR)
#define T1CCR_p		((struct _TxCCR *) &T1CCR)
#define T2CCR_p		((struct _TxCCR *) &T2CCR)
#define T3CCR_p		((struct _TxCCR *) &T3CCR)

#define T0IR_p		((struct _TxIR *) &T0IR)
#define T1IR_p		((struct _TxIR *) &T1IR)
#define T2IR_p		((struct _TxIR *) &T2IR)
#define T3IR_p		((struct _TxIR *) &T3IR)

#define PCONP_p		((union _PCONP *) &PCONP)
#define PCLKSEL0_p	((union _PCLKSEL0 *) &PCLKSEL0)
#define PCLKSEL1_p	((union _PCLKSEL1 *) &PCLKSEL0)

// ----------------------------------------------------------------------------
//PCLK_xyz = CCLK
#ifndef setCCLK
#define setCCLK		1
#endif

//PCLK_xyz = CCLK/2
#ifndef setCCLKD2
#define setCCLKD2	2
#endif

//PCLK_xyz = CCLK/4
#ifndef setCCLKD4
#define setCCLKD4	0
#endif

//PCLK_xyz = CCLK/8
#ifndef setCCLKD8
#define setCCLKD8	3
#endif

//PeripheralÆs clock is selected to PCLK_xyz = CCLK/8
//except for CAN1, CAN2, and CAN filtering when Æ11Æ
//selects PCLK_xyz = CCLK/6.
#ifndef setCCLKD6
#define setCCLKD6	3
#endif
#endif
